//--------------------------------------------
// Test Tanween Fatih تنوين الفتح/الرفع
// Issue : 1.01
// Date  : 22 July 2020
// Author: Mohsen Alyafei
// Test cases are provided for all possibilities I know
// of including cases for tashkeel (تشكيل) cases.
//--------------------------------------------
import {stringTanweenFatih} from './stringTanweenFatih.js';

//============ test codes ==================
var r=0; // test tracker
//--------------------------------------------------------------
//  كلمات تنتهي بهمزة بعد حرف ساكن
//--------------------------------------------------------------
r |= test("عبء","عبئًا");
r |= test("عِبْءُ","عِبْئًا");
r |= test("دفء","دفئًا");
r |= test("دِفْءُ","دِفْئًا");
r |= test("ملء","ملئًا");
r |= test("مَلْءُ","مَلْئًا");
r |= test("مِلْءُ","مِلْئًا");
r |= test("كفء","كفئًا");
r |= test("كَفْءُ","كَفْئًا");
r |= test("كُفْء","كُفْئًا");
r |= test("نشء","نشئًا");
r |= test("نَشْءُ","نَشْئًا");
r |= test("وطء","وطئًا");
r |= test("وَطْءُ","وَطْئًا");
r |= test("بطء","بطئًا");
r |= test("بَطْءُ","بَطْئًا");
r |= test("بُطْءُ","بُطْئًا");
//--------------------------------------------------------------
//  كلمات تنتهي بهمزة بعد حرف الياء
//--------------------------------------------------------------
r |= test("شيء","شيئًا");
r |= test("شَيءُ","شَيئًا");
r |= test("فيءٌ","فيئًا");
r |= test("فَيْءٌ","فَيْئًا");
r |= test("بطيء","بطيئًا");
r |= test("بَطِيءٌ","بَطِيئًا");
r |= test("مريء","مريئًا");
r |= test("مَريْءٌ","مَريْئًا");
r |= test("مليء","مليئًا");
r |= test("مَليْءٌ","مَليْئًا");
r |= test("جريء","جريئًا");
r |= test("جَرْيءٌ","جَرْيئًا");
r |= test("هنيء","هنيئًا");
r |= test("هَنيءٌ","هَنيئًا");
r |= test("دنيء","دنيئًا");
r |= test("دَنِيءٌ","دَنِيئًا");
r |= test("رديء","رديئًا");
r |= test("رَدِيءٌ","رَدِيئًا");
r |= test("مضيء","مضيئًا");
r |= test("مُضِيءٌ","مُضِيئًا");
r |= test("بريء","بريئًا");
r |= test("بَرِيءٌ","بَرِيئًا");
//--------------------------------------------------------------
//  كلمات تنتهي بهمزة بعد حرف مقطوع (د ذ ر ز و)  تم
//--------------------------------------------------------------
r |= test("سوء","سوءًا");
r |= test("سُوءٌ","سُوءًا");
r |= test("جزء","جزءًا");
r |= test("جُزْء","جُزْءًا");
r |= test("بدء","بدءًا");
r |= test("بِدْءُ","بِدْءًا");
r |= test("ردء","ردءًا");
r |= test("رِدْءٌ","رِدْءًا");
r |= test("برء","برءًا");
r |= test("بِرْء","بِرْءًا");
r |= test("ضوء","ضوءًا");
r |= test("ضَوء","ضَوءًا");
r |= test("لجوء","لجوءًا");
r |= test("لُجوُءٌ","لُجوُءًا");
r |= test("هدوء","هدوءًا");
r |= test("هُدوءٌ","هُدوءًا");
r |= test("نشوء","نشوءًا");
r |= test("نُشوءٍ","نُشوءًا");
r |= test("وضوء","وضوءًا");
r |= test("وضوءٌ","وضوءًا");
r |= test("مخبوء","مخبوءًا");
r |= test("مَخْبوء","مَخْبوءًا");
r |= test("موبوء","موبوءًا");
r |= test("مَوْبُوءٌ","مَوْبُوءًا");
r |= test("مجزوء","مجزوءًا");
r |= test("مَجْزوء","مَجْزوءًا");
r |= test("مملوءٌ","مملوءًا");
r |= test("مَمْلوءٌ","مَمْلوءًا");
r |= test("مقروءٌ","مقروءًا");
r |= test("مَقْروءٌ","مَقْروءًا");
r |= test("مبدوء","مبدوءًا");
r |= test("مَبْدوءٍ","مَبْدوءًا");
//--------------------------------------------------------------
//  كلمات تنتهي بهمزة متطرفة على ألِف مقصورة
//--------------------------------------------------------------
r |= test("لاجئ","لاجئًا");
r |= test("لاجِئُ","لاجِئًا");
r |= test("ضمئ","ضمئًا");
r |= test("ضَمَئُ","ضَمَئًا");
r |= test("شاطئ","شاطئًا");
r |= test("شاطِئٌ","شاطِئًا");
r |= test("بارئ","بارئًا");
r |= test("بارِئٌ","بارِئًا");
r |= test("بادئ","بادئًا");
r |= test("بادِئٌ","بادِئًا");
r |= test("هادئ","هادئًا");
r |= test("هادِئٌ","هادِئًا");
r |= test("قارئ","قارئًا");
r |= test("قارِئٌ","قارِئًا");
r |= test("مخطئُ","مخطئًا");
r |= test("مُخْطِئُ","مُخْطِئًا");
r |= test("موطئ","موطئًا");
r |= test("مُوطِئٌ","مُوطِئًا");
r |= test("مقرِئ","مقرِئًا");
r |= test("مُقرِئٌ","مُقرِئًا");
r |= test("دافئ","دافئًا");
r |= test("دافِئٍ","دافِئًا");
r |= test("مخطئ","مخطئًا");
r |= test("مُخْطِئ","مُخْطِئًا");
r |= test("مفاجئ","مفاجئًا");
r |= test("مُفاجِئ","مُفاجِئًا");
r |= test("مبتدئ","مبتدئًا");
r |= test("مُبتَدِئ","مُبتَدِئًا");
r |= test("موانئ","موانئًا");
r |= test("مَوانِئُ","مَوانِئًا");
//--------------------------------------------------------------
//  كلمات ثلاثية تنتهي بألِف مقصورة
//--------------------------------------------------------------
r |= test("فتى","فتًى");
r |= test("فَتَىَ","فَتًى");
r |= test("منى","منًى");
r |= test("مُنَىَ","مُنًى");
r |= test("سدى","سدًى");
r |= test("سُدَىَ","سُدًى");
r |= test("هوى","هوًى");
r |= test("هَوَىَ","هَوًى");
r |= test("رحى","رحًى");
r |= test("رَحَىَ","رَحًى");
r |= test("لحى","لحًى");
r |= test("لِحَى","لِحًى");
//--------------------------------------------------------------
//  كلمات فوق ثلاثية تنتهي بألِف مقصورة
//--------------------------------------------------------------
r |= test("مرسى","مرسًى");
r |= test("مَرسَىَ","مَرسًى");
r |= test("حبلى","حبلًى");
r |= test("حُبلى","حُبلًى");
r |= test("مسعى","مسعًى");
r |= test("مَسعى","مَسعًى");
r |= test("صغرى","صغرًى");
r |= test("صُغْرى","صُغْرًى");
r |= test("حسنى","حسنًى");
r |= test("حُسْنَى","حُسْنًى");
r |= test("بشرى","بشرًى");
r |= test("بُشْرىَ","بُشْرًى");
r |= test("منتدى","منتدًى");
r |= test("مُنْتَدَى","مُنْتَدًى");
r |= test("مصطفى","مصطفًى");
r |= test("مُصْطَفَىَ","مُصْطَفًى");
r |= test("مستدعى","مستدعًى");
r |= test("مُستدعىَ","مُستدعًى");
r |= test("مستشفى","مستشفًى");
r |= test("مستشفَىَ","مستشفًى");
//--------------------------------------------------------------
//   كلمات تنتهي بهمزة متطرفة بعد ألِف ممدودة متصلة
//--------------------------------------------------------------
r |= test("ماء","ماءً");
r |= test("مَاءُ","مَاءً");
r |= test("آباء","آباءً");
r |= test("آبَاءٌ","آبَاءً");
r |= test("سماء","سماءً");
r |= test("سَمَاءُ","سَمَاءً");
r |= test("بناء","بناءً");
r |= test("بِنَاءٌ","بِنَاءً");
r |= test("وعاء","وعاءً");
r |= test("وِعَاءُ","وِعَاءً");
r |= test("غطاء","غطاءً");
r |= test("غِطَاءٍ","غِطَاءً");
r |= test("كساء","كساءً");
r |= test("كِسَاءُ","كِسَاءً");
r |= test("خطّاء","خطّاءً");
r |= test("خَطَّاءٌ","خَطَّاءً");
r |= test("وضّاء","وضّاءً");
r |= test("وَضَّاءٌ","وَضَّاءً");
r |= test("هناء","هناءً");
r |= test("هَنَاءُ","هَنَاءً");
r |= test("وفاء","وفاءً");
r |= test("وَفَاءُ","وَفَاءً");
r |= test("وباء","وباءً");
r |= test("وَبَاءُ","وَبَاءً");
r |= test("دعاء","دعاءً");
r |= test("دُعَاءُ","دُعَاءً");
r |= test("شقاء","شقاءً");
r |= test("شَقَاءُ","شَقَاءً");
r |= test("وقاء","وقاءً");
r |= test("وِقَاءُ","وِقَاءً");
r |= test("إنشاء","إنشاءً");
r |= test("إنْشَاءٌ","إنْشَاءً");
r |= test("أحياء","أحياءً");
r |= test("أحْيَاءُ","أحْيَاءً");
r |= test("حسناء","حسناءً");
r |= test("حَسْنَاءٌ","حَسْنَاءً");
r |= test("بيضاء","بيضاءً");
r |= test("بَيْضَاءٌ","بَيْضَاءً");
r |= test("سفهاء","سفهاءً");
r |= test("سُفَهَاءُ","سُفَهَاءً");


r |= test("ولاء","ولاءً");
r |= test("طلاء","طلاءً");
r |= test("ملاء","ملاءً");
r |= test("جلاء","جلاءً");
r |= test("نجلاء","نجلاءً");
r |= test("أشلاء","أشلاءً");
r |= test("أذلاء","أذلاءً");
r |= test("إعلاء","إعلاءً");
r |= test("دخلاء","دخلاءً");
r |= test("نزلاء","نزلاءً");
r |= test("استيلاء","استيلاءً");

//--------------------------------------------------------------
//   كلمات تنتهي بهمزة متطرفة بعد ألِف ممدودة غير متصلة
//--------------------------------------------------------------
r |= test("داء","داءً");
r |= test("دَاءُ","دَاءً");
r |= test("رداء","رداءً");
r |= test("رِداءُ","رِداءً");
r |= test("نداء","نداءً");
r |= test("نِدَاءٌ","نِدَاءً");
r |= test("بيداء","بيداءً");
r |= test("بَيدَاءَ","بَيدَاءً");
r |= test("أعداء","أعداءً");
r |= test("أعْداءٍ","أعْداءً");
r |= test("ابتداء","ابتداءً");
r |= test("ابْتِداءٌ","ابْتِداءً");

r |= test("حِذَاء","حِذَاءً");
r |= test("حذاء","حذاءً");
r |= test("جذاء","جذاءً");
r |= test("جُذاءٌ","جُذاءً");
r |= test("غذاء","غذاءً");
r |= test("غِذاءٍ","غِذاءً");
r |= test("إيذاء","إيذاءً");
r |= test("إيْذَاءٌ","إيْذَاءً");

r |= test("آراء","آراءً");
r |= test("آراءٍ","آراءً");
r |= test("قرّاء","قرّاءً");
r |= test("قُرَّاء","قُرَّاءً");
r |= test("حمراء","حمراءً");
r |= test("حَمراءٌ","حَمراءً");
r |= test("حوراء","حوراءً");
r |= test("حَوْراءٌ","حَوْراءً");
r |= test("صحراء","صحراءً");
r |= test("عشواء","عشواءً");
r |= test("خضراء","خضراءً");
r |= test("افتراء","افتراءً");
r |= test("افْتِرَاء","افْتِرَاءً");
r |= test("استخراء","استخراءً");
r |= test("اسْتِخْراءٌ","اسْتِخْراءً");

r |= test("جزاء","جزاءً");
r |= test("جَزاءُ","جَزاءً");
r |= test("عزاء","عزاءً");
r |= test("عَزاءُ","عَزاءً");
r |= test("إزاء","إزاءً");
r |= test("إزًاءٌ","إزًاءً");
r |= test("أجزاء","أجزاءً");
r |= test("أجْزَاءٌ","أجْزَاءً");
r |= test("جوزاء","جوزاءً");
r |= test("جَوْزَاءٍ","جَوْزَاءً");
r |= test("عوراء","عوراءً");
r |= test("عَورَاءٍ","عَورَاءً");
r |= test("اجتزاء","اجتزاءً");
r |= test("اجْتِزاءٌ","اجْتِزاءً");
r |= test("استهزاء","استهزاءً");
r |= test("استِهْزاءٌ","استِهْزاءً");

r |= test("دواء","دواءً");
r |= test("دَوَاءُ","دَوَاءً");
r |= test("سواء","سواءً");
r |= test("سَوَاءٌ","سَوَاءً");
r |= test("هواء","هواءً");
r |= test("هَوَاءُ","هَوَاءً");
r |= test("عوآء","عوآءً");
r |= test("عُوآءُ","عُوآءً");
r |= test("شواء","شواءً");
r |= test("شِوَاءٌ","شِوَاءً");
r |= test("أضواء","أضواءً");
r |= test("أضواءٌ","أضواءً");
//--------------------------------------------------------------
//  كلمات تنتهي بهمزة متطرفة فوق/على ألِف ممدودة موصولة
//--------------------------------------------------------------
r |= test("مأ","مأً");
r |= test("مَأ","مَأً");
r |= test("نشأ","نشأً");
r |= test("نَشَأ","نَشَأً");
r |= test("خطأ","خطأً");
r |= test("خَطَأ","خَطَأً");
r |= test("نبأ","نبأً");
r |= test("نَبَأ","نَبَأً");
r |= test("مدفأ","مدفأً");
r |= test("مِدْفَأ","مِدْفَأً");
r |= test("مرجأ","مرجأً");
r |= test("مِرْجَأ","مِرْجَأً");
r |= test("متكأ","متكأً");
r |= test("مُتَّكَأ","مُتَّكَأً");
r |= test("مخبأ","مخبأً");
r |= test("مَخبَأ","مَخبَأً");
r |= test("منشأ","منشأً");
r |= test("مَنْشَأ","مَنْشَأً");
//--------------------------------------------------------------
//  كلمات تنتهي بهمزة متطرفة فوق/على ألِف ممدودة غير موصولة
//--------------------------------------------------------------
r |= test("مبدأ","مبدأً");
r |= test("مَبْدأ","مَبْدأً");
r |= test("مبتدأ","مبتدأً");
r |= test("مُبتدَأ","مُبتدَأً");
//--------------------------------------------------------------
//  كلمات تنتهي بألِف ممدودة موصولة
//--------------------------------------------------------------
r |= test("علا","علًا");
r |= test("عَلا","عَلًا");
r |= test("عصا","عصًا");
r |= test("عَصَا","عَصًا");
r |= test("عشا","عشًا");
r |= test("عَشَا","عَشًا");
r |= test("رضا","رضًا");
r |= test("رضَا","رضًا");
r |= test("اسا","اسًا");
r |= test("اسَا","اسًا");
r |= test("ربا","ربًا");
r |= test("رِبَا","رِبًا");
r |= test("قطا","قطًا");
r |= test("قَطَا","قَطًا");

//--------------------------------------------------------------
//  كلمات تنتهي بألِف ممدودة غير موصولة
//--------------------------------------------------------------
r |= test("عرا","عرًا");
r |= test("عَرَا","عَرًا");
//--------------------------------------------------------------
//  كلمات تنتهي بهمزة على الواو الموصولة
//--------------------------------------------------------------
r |= test("كفؤ","كفؤًا");
r |= test("كُفؤٍ","كُفؤًا");
r |= test("تنبؤ","تنبؤًا");
r |= test("تَنَبُؤٌ","تَنَبُؤًا");
r |= test("لؤلؤ","لؤلؤًا");
r |= test("لُؤْلؤٌ","لُؤْلؤًا");
r |= test("جؤجؤ","جؤجؤًا");
r |= test("جُؤْجُؤٌ","جُؤْجُؤًا");
r |= test("بؤبؤ","بؤبؤًا");
r |= test("بُؤْبُؤٌ","بُؤْبُؤًا");
r |= test("تلكؤ","تلكؤًا");
r |= test("تَلَكُّؤٍ","تَلَكُّؤًا");
r |= test("تقيؤ","تقيؤًا");
r |= test("تَقَيُّؤٌ","تَقَيُّؤًا");
r |= test("تكافؤ","تكافؤًا");
r |= test("تَكَافُؤٌ","تَكَافُؤًا");
r |= test("تواطؤ","تواطؤًا");
r |= test("تَوَاطُؤٍ","تَوَاطُؤًا");
//--------------------------------------------------------------
//  كلمات تنتهي بهمزة على الواو غير الموصولة
//--------------------------------------------------------------
r |= test("تهرؤ","تهرؤًا");
r |= test("تَهَرؤ","تَهَرؤًا");
r |= test("إمرؤ","إمرؤًا");
r |= test("إمْرُؤٌ","إمْرُؤًا");
//--------------------------------------------------------------
//  كلمات تنتهي بتاء مربوطة متصلة
//--------------------------------------------------------------
r |= test("مئة","مئةً");
r |= test("مِئَةٌ","مِئَةً");
r |= test("فئة","فئةً");
r |= test("فِئِةٍ","فِئِةً");
r |= test("علبة","علبةً");
r |= test("عِلْبَةٌ","عِلْبَةً");
r |= test("مائة","مائةً");
r |= test("مائَةٌ","مائَةً");
r |= test("ساعة","ساعةً");
r |= test("سَاعَةٌ","سَاعَةً");
r |= test("نعمة","نعمةً");
r |= test("نِعْمَةٌ","نِعْمَةً");
r |= test("مدرسة","مدرسةً");
r |= test("مَدرسَةٍ","مَدرسَةً");
r |= test("مَدرسَةٌ","مَدرسَةً");
//--------------------------------------------------------------
//  كلمات تنتهي بتاء مربوطة غير متصلة
//--------------------------------------------------------------
r |= test("عدة","عدةً");
r |= test("عِدَّةٍ","عِدَّةً");
r |= test("شدة","شدةً");
r |= test("شِدَّةٍ","شِدَّةً");
r |= test("كرة","كرةً");
r |= test("كُرَةٍ","كُرَةً");
r |= test("ليرة","ليرةً");
r |= test("لَيْرَةٍ","لَيْرَةً");
r |= test("فتاة","فتاةً");
r |= test("فَتَاةٍ","فَتَاةً");
r |= test("إشارةَ","إشارةً");
r |= test("إشَارَةَ","إشَارَةً");
r |= test("إمرأة","إمرأةً");
r |= test("إمْرَأةٍ","إمْرَأةً");
r |= test("سيارة","سيارةً");
r |= test("سَيَّارَةٍ","سَيَّارَةً");
//--------------------------------------------------------------
//  كلمات تنتهي بحرف الهاء
//--------------------------------------------------------------
r |= test("كره","كرهًا");
r |= test("كُرْهٌ","كُرْهًا");
r |= test("جنيه","جنيهًا");
r |= test("جِنَيْهٌ","جِنَيْهًا");
r |= test("منزه","منزهًا");
r |= test("مُنَزَّهٌ","مُنَزَّهًا");
r |= test("شياه","شياهًا");
r |= test("شِيَاهٌ","شِيَاهًا");
r |= test("اتجاه","اتجاهًا");
r |= test("اتِّجاهٌ","اتِّجاهًا");
r |= test("انتباه","انتباهًا");
r |= test("انْتِباهٌ","انْتِباهًا");
//--------------------------------------------------------------
//  كلمات من حرفين
//--------------------------------------------------------------
r |= test("أب","أبًا");
r |= test("أَبٌ","أَبًا");
r |= test("أخ","أخًا");
r |= test("أَخٌ","أَخًا");
r |= test("أم","أمًا");
r |= test("أُمّ","أُمًّا");
r |= test("أُمٌّ","أُمًّا");
r |= test("سد","سدًا");
r |= test("سَدٌّ","سَدًّا");
r |= test("مر","مرًا");
r |= test("مَرً","مَرًا");
r |= test("طق","طقًا");
r |= test("طَقٌ","طَقًا");
r |= test("مع","معًا");
r |= test("مَعٌ","مَعًا");
r |= test("يد","يدًا");
r |= test("يَدٌ","يَدًا");
r |= test("غد","غدًا");
r |= test("غَدٌ","غَدًا");
r |= test("إذ","إذًا");
r |= test("إذْ","إذًا");
r |= test("أُف","أُفًا");
r |= test("أُفٌ","أُفًا");
r |= test("حم","حمًا");
r |= test("حَمٌ","حَمًا");
r |= test("سم","سمًا");
r |= test("سُمٌّ","سُمًّا");
r |= test("كم","كمًا");
r |= test("كَمٌّ","كَمًّا");
r |= test("فم","فمًا");
r |= test("فم","فمًا");
r |= test("دم","دمًا");
r |= test("دمٌ","دمًا");
r |= test("حل","حلًا");
r |= test("حلٌ","حلًا");
r |= test("فل","فلًا");
r |= test("فلٌ","فلًا");
r |= test("أي","أيًا");
r |= test("أيٌ","أيًا");
r |= test("في","فيًا");
r |= test("فَيٌ","فَيًا");
r |= test("ضي","ضيًا");
r |= test("ضَيٌ","ضَيًا");
r |= test("طي","طيًا");
r |= test("طَيٌّ","طَيًّا");
//--------------------------------------------------------------
//  كلمات أخرى عادية
//--------------------------------------------------------------
r |= test("بحر","بحرًا");
r |= test("بَحْرُ","بَحْرًا");
r |= test("نهر","نهرًا");
r |= test("نَهرُ","نَهرًا");
r |= test("بيت","بيتًا");
r |= test("بَيتُ","بَيتًا");
r |= test("ولد","ولدًا");
r |= test("وَلَدُ","وَلَدًا");
r |= test("بنت","بنتًا");
r |= test("بِنْتً","بِنْتًا");
r |= test("بلد","بلدًا");
r |= test("بَلَدُ","بَلَدًا");
r |= test("ألف","ألفًا");
r |= test("ألْفَ","ألْفًا");
r |= test("شرطَ","شرطًا");
r |= test("شَرطَ","شَرطًا");
r |= test("ظبي","ظبيًا");
r |= test("ظَبيُ","ظَبيًا");
r |= test("ثدي","ثديًا");
r |= test("ثَدي","ثَديًا");
r |= test("خزي","خزيًا");
r |= test("خَزي","خَزيًا");
r |= test("دوي","دويًا");
r |= test("دَوّي","دَوّيًا");
r |= test("سني","سنيًا");
r |= test("سُنّي","سُنّيًا");
r |= test("بني","بنيًا");
r |= test("بُنّي","بُنّيًا");
r |= test("زهي","زهيًا");
r |= test("زَهيٌّ","زَهيًّا");
r |= test("شقي","شقيًا");
r |= test("صفي","صفيًا");
r |= test("مكي","مكيًا");
r |= test("مشي","مشيًا");
r |= test("ذكي","ذكيًا");
r |= test("وحي","وحيًا");
r |= test("وصي","وصيًا");
r |= test("فتي","فتيًا");
r |= test("غني","غنيًا");
r |= test("غبي","غبيًا");
r |= test("سوي","سويًا");
r |= test("فني","فنيًا");
r |= test("طهي","طهيًا");
r |= test("سري","سريًا");
r |= test("قطري","قطريًا");
r |= test("قطريّ","قطريًّا");
r |= test("قاضي","قاضيًا");
r |= test("ساعي","ساعيًا");
r |= test("رامي","راميًا");
r |= test("كويتي","كويتيًا");
r |= test("كُوَيتِيٍّ","كُوَيتِيًّا");
r |= test("دلو","دلوًا");
r |= test("دَلْوٌ","دَلْوًا");
r |= test("شبه","شبهًا");
r |= test("شبهٌ","شبهًا");
r |= test("شهب","شهبًا");
r |= test("شهبٌ","شهبًا");
r |= test("سؤال","سؤالًا");
r |= test("سؤالٌ","سؤالًا");
r |= test("ريال","ريالًا");
r |= test("ريالَ","ريالًا");
r |= test("شيكل","شيكلًا");
r |= test("شيكلَ","شيكلًا");
r |= test("كتاب","كتابًا");
r |= test("كِتابٌ","كِتابًا");
r |= test("كرسي","كرسيًا");
r |= test("كرسيٌّ","كرسيًّا");
r |= test("متحف","متحفًا");
r |= test("متحفٌ","متحفًا");
r |= test("مدرس","مدرسًا");
r |= test("مُدَرِّسٌ","مُدَرِّسًا");
r |= test("مليون","مليونًا");
r |= test("مِلْيونَ","مِلْيونًا");
r |= test("دينار","دينارًا");
r |= test("دينارٌ","دينارًا");
r |= test("دولار","دولارًا");
r |= test("دولارٌ","دولارًا");
r |= test("مذياع","مذياعًا");
r |= test("تلفازً","تلفازًا");
r |= test("ستوتنكا","ستوتنكًا");
r |= test("ستُوتِنْكَا","ستُوتِنْكًا");
//--------------------------------------------------------------
if (r==0) console.log("Test Cases Passed.");
//--------------------------------------------------------------
function test(n,should) {
let result = stringTanweenFatih(n);
if (result !== should) {console.log(`${n} Output   : ${result}\n${n} Should be: ${should}`);return 1;}
}
